app/Modules/Admin/Models/ClienteModel.php

SELECT `tb1`.*, `tb2`.`doc_nombre`, `tb3`.`prr_nombre`, `tb4`.`id` `id_canton`, `tb4`.`ctn_nombre`, `tb5`.`id` `id_provincia`, `tb5`.`prv_nombre`
FROM `cc_clientes` `tb1`
LEFT JOIN `cc_tipo_documento` `tb2` ON `tb1`.`fk_tipo_documento` = `tb2`.`id`
LEFT JOIN `cc_parroquia` `tb3` ON `tb1`.`fk_parroquia` = `tb3`.`id`
LEFT JOIN `cc_canton` `tb4` ON `tb3`.`fk_canton` = `tb4`.`id`
LEFT JOIN `cc_provincia` `tb5` ON `tb4`.`fk_provincia` = `tb5`.`id`
---
    public function getClientes($ciruc) {
        $builder = $this->db->table('cc_clientes tb1');
        $builder->select('tb1.*,
                            tb2.doc_nombre,
                            tb3.prr_nombre,
                            tb4.id id_canton,
                            tb4.ctn_nombre,
                            tb5.id id_provincia,
                            tb5.prv_nombre');

        $builder->join('cc_tipo_documento tb2', 'tb1.fk_tipo_documento = tb2.id', 'left');
        $builder->join('cc_parroquia tb3', 'tb1.fk_parroquia = tb3.id', 'left');
        $builder->join('cc_canton tb4', 'tb3.fk_canton = tb4.id', 'left');
        $builder->join('cc_provincia tb5', 'tb4.fk_provincia = tb5.id', 'left');

        if (!empty($ciruc)) {
            $builder->where('tb1.clie_dni', $ciruc);
        }

        $response = $builder->get();