app/Modules/Admin/Models/ProductosModel.php

    public function getProductos($whereQuery) {
        $builder = $this->db->table('cc_productos tb1');
        $builder->select('tb1.*,'
                . ' tb2.mrc_nombre,'
                . ' tb3.um_nombre,'
                . ' tb3.um_nombre_corto,'
                . ' tb4.sgr_nombre,'
                . ' tb5.id id_grupo,'
                . ' tb5.gr_nombre,'
                . ' tb6.tp_nombre,'
                . ' tb7.fk_impuestotarifa idImpuesto,'
                . ' tb8.fk_impuestotarifa idImpuestoIce,'
                . ' tb9.pp_valor');
        $builder->join("cc_marcas tb2", "tb2.id = tb1.fk_marca", "left");
        $builder->join("cc_unidades_medida tb3", "tb3.id = tb1.fk_unidadmedida");
        $builder->join("cc_subgrupos tb4", "tb4.id = tb1.fk_subgrupo");
        $builder->join("cc_grupos tb5", "tb5.id = tb4.fk_grupo");
        $builder->join("cc_tipo_producto tb6", "tb6.id = tb1.fk_tipoproducto");
        $builder->join("cc_producto_impuestotarifa tb7", "tb7.fk_producto = tb1.id AND tb7.fk_impuesto = 1");
        $builder->join("cc_producto_impuestotarifa tb8", "tb8.fk_producto = tb1.id AND tb8.fk_impuesto = 2", "left");
        $builder->join("cc_producto_precios tb9", "tb9.fk_producto = tb1.id AND tb9.fk_tipo_precio = 1");

        if ($whereQuery) {
            foreach ($whereQuery as $key => $val) {
                $builder->where($key, $val);
            }
        }
        $builder->orderBy('tb1.prod_nombre','asc');

        $response = $builder->get();
---
SELECT `tb1`.*, `tb2`.`mrc_nombre`, `tb3`.`um_nombre`, `tb3`.`um_nombre_corto`, `tb4`.`sgr_nombre`, `tb5`.`id` `id_grupo`, `tb5`.`gr_nombre`, `tb6`.`tp_nombre`, `tb7`.`fk_impuestotarifa` `idImpuesto`, `tb8`.`fk_impuestotarifa` `idImpuestoIce`, `tb9`.`pp_valor`
FROM `cc_productos` `tb1`
LEFT JOIN `cc_marcas` `tb2` ON `tb2`.`id` = `tb1`.`fk_marca`
JOIN `cc_unidades_medida` `tb3` ON `tb3`.`id` = `tb1`.`fk_unidadmedida`
JOIN `cc_subgrupos` `tb4` ON `tb4`.`id` = `tb1`.`fk_subgrupo`
JOIN `cc_grupos` `tb5` ON `tb5`.`id` = `tb4`.`fk_grupo`
JOIN `cc_tipo_producto` `tb6` ON `tb6`.`id` = `tb1`.`fk_tipoproducto`
JOIN `cc_producto_impuestotarifa` `tb7` ON `tb7`.`fk_producto` = `tb1`.`id` AND `tb7`.`fk_impuesto` = 1
LEFT JOIN `cc_producto_impuestotarifa` `tb8` ON `tb8`.`fk_producto` = `tb1`.`id` AND `tb8`.`fk_impuesto` = 2
JOIN `cc_producto_precios` `tb9` ON `tb9`.`fk_producto` = `tb1`.`id` AND `tb9`.`fk_tipo_precio` = 1