app/Models/ModulesModel.php

SELECT `tb3`.*, `tb4`.`emp_apellido`, `tb4`.`emp_nombre`
FROM `cc_roles_modulos` `tb1`
JOIN `cc_roles` `tb2` ON `tb2`.`id` = `tb1`.`fk_rol`
JOIN `cc_modulos` `tb3` ON `tb3`.`id` = `tb1`.`fk_modulo`
JOIN `cc_empleados` `tb4` ON `tb4`.`fk_rol` = `tb2`.`id`
WHERE `tb4`.`id` = '1'
AND `tb3`.`md_tipo` = 'modulo'
AND `tb3`.`md_estado` = 1
ORDER BY `tb3`.`md_orden` ASC
SELECT *
FROM `cc_modulos`
WHERE `md_estado` = 1
AND `md_tipo` = 'modulo'
ORDER BY `md_orden` ASC
---
    public function getModulosUser($idUser) {

        $builder = $this->db->table('cc_roles_modulos tb1');
        $builder->select('tb3.*, tb4.emp_apellido,tb4.emp_nombre');
        $builder->join('cc_roles tb2 ', 'tb2.id = tb1.fk_rol');
        $builder->join('cc_modulos tb3 ', 'tb3.id = tb1.fk_modulo');
        $builder->join('cc_empleados tb4 ', 'tb4.fk_rol = tb2.id');
        $builder->where(['tb4.id' => $idUser->id, 'tb3.md_tipo' => 'modulo', 'tb3.md_estado' => 1]);
        $builder->orderBy('tb3.md_orden', 'asc');
        $respuesta = $builder->get();

        if ($idUser->root) {
            $builder = $this->db->table('cc_modulos');
            $builder->select('*');
            $builder->where(['md_estado' => 1, 'md_tipo' => 'modulo']);
            $builder->orderBy('md_orden', 'asc');
            $respuesta = $builder->get();